lab11_php_ci/app/Controllers/Admin.php

    public function article()
    {
        $model = new ArtikelModel();
        // Ambil semua data artikel, diurutkan dari yang terbaru
        $artikel = $model->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `artikel`
ORDER BY `created_at` DESC